In [1]:
# Import Dependencies
import pandas as pd
import os

In [2]:
df_list = []

In [3]:
print( os.listdir("Temperature_File"))

['daily-summaries-2000.csv', 'daily-summaries-2003.csv', 'daily-summaries-2006.csv', 'daily-summaries-2009.csv', 'daily-summaries-2012.csv', 'daily-summaries-2015.csv', 'daily-summaries-2018.csv']

In [4]:
for file in os.listdir("Temperature_File"):
    df = pd.read_csv("Temperature_File/" + file)
    df_list.append(df)

        

result = pd.concat(df_list)
        
        #concatenate dataframes
#df = pd.concat(frames, sort=False)

In [5]:
result.head()

       STATION  LATITUDE  LONGITUDE  ELEVATION      DATE  TMAX  TMIN  TOBS
0  USW00094789  40.63915  -73.76401        3.4  1/1/2000   7.8  -0.6   NaN
1  USW00094789  40.63915  -73.76401        3.4  1/2/2000  12.2   2.8   NaN
2  USW00094789  40.63915  -73.76401        3.4  1/3/2000  15.6   7.8   NaN
3  USW00094789  40.63915  -73.76401        3.4  1/4/2000  12.8   8.3   NaN
4  USW00094789  40.63915  -73.76401        3.4  1/5/2000   8.3  -2.2   NaN

In [6]:
result.count()

STATION      21626
LATITUDE     21626
LONGITUDE    21626
ELEVATION    21626
DATE         21626
TMAX         21496
TMIN         21499
TOBS          4680
dtype: int64

In [7]:
#add a column for average between TMAX and TMIN
#df['avg1'] = df[['TMAX', 'TMIN']].mean(axis=1,skipna=None)
#(df["TMAX"]+df["TMIN"])/2
#https://stackoverflow.com/questions/34734940/row-wise-average-for-a-subset-of-columns-with-missing-values

In [13]:
df = result
df['DATE'] = pd.to_datetime(df['DATE'])
df["YEAR"] = df["DATE"].dt.year
df = df.drop(columns=["TOBS"])
df["TEMP_AVG"] = df[["TMAX","TMIN"]].mean(axis=1)
sum_df = df.groupby(["STATION","YEAR","LATITUDE","LONGITUDE"])["TEMP_AVG"].mean()
sum_df=sum_df.reset_index(drop=False)

In [14]:
#df.head(1000)
sum_df.head()

       STATION  YEAR  LATITUDE  LONGITUDE   TEMP_AVG
0  USC00020404  2003   32.7306  -111.6917  24.045059
1  USC00020404  2006   32.7306  -111.6917  21.639315
2  USC00020404  2009   32.7306  -111.6917  22.109066
3  USC00020404  2012   32.7306  -111.6917  20.966433
4  USC00020404  2015   32.7306  -111.6917  21.131983

In [10]:
#convert to CSV
#https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html
sum_df.to_csv("Temperature_File/sum_df.csv",index=False)